package Sotrings;

import java.util.ArrayList;
import java.util.List;
/**
 * Напоминание: Массивы размерностью 1 и 0 сортировать не нужно, мы можем просто их вернуть(это будет нащ базовый
 * случай для быстрой сортировки)!
 *  Алгоритм быстрой сортировки основывается на стратегии - разделяй и властвуй. Следовательно, массив
 *  должен разделяться до тех пор, пока мы не дойдем до базового случая.
 *  1 - Ищем опорный элемент.
 *  2 - Ищем элементы больше и меньше опорного. Этот процесс называется разделением. После этого
 *  этапа у нас есть под массив всех элементов, меньших опорного, опорный элемент,
 *  подмассив всех элементов больше опорного
 */


public class QuickSort {

}
